In [7]:
import numpy as np
np.nan   #nan 缺失值

nan

In [8]:
type(np.nan)

float

In [9]:
from pandas import DataFrame, Series
import pandas as pd
from numpy import NaN
series_obj = Series([1, None, NaN])
series_obj

0    1.0
1    NaN
2    NaN
dtype: float64

In [10]:
pd.isnull(series_obj)       # 检查是否为空值或缺失值

0    False
1     True
2     True
dtype: bool

In [11]:
series_obj = Series([1, None, NaN])     #创建包含空值和缺失值的series对象
pd.notnull(series_obj)       # 检查是否不为空值或缺失值

0     True
1    False
2    False
dtype: bool

In [12]:
import pandas as pd
import numpy as np
df_obj = pd.DataFrame({"类别":['小说', '散文随笔', '青春文学', '传记'],
                       "书名":[np.nan, '《皮囊》', '《旅程结束时》', '《老舍自传》'],
                       "作者":["老舍", None, "张其鑫", "老舍"]})
df_obj

        书名    作者    类别
0      NaN    老舍    小说
1     《皮囊》  None  散文随笔
2  《旅程结束时》   张其鑫  青春文学
3   《老舍自传》    老舍    传记

In [13]:
df_obj.dropna(axis=1)

     类别
0    小说
1  散文随笔
2  青春文学
3    传记

In [14]:
df_obj.dropna()     # 删除数据集中的空值和缺失值

        书名   作者    类别
2  《旅程结束时》  张其鑫  青春文学
3   《老舍自传》   老舍    传记

In [15]:
df_obj = pd.DataFrame({'A': [1, 2, 3, NaN],
                       'B': [NaN, 4, NaN, 6],
                       'C': ['a', 7, 8, 9],
                       'D':[NaN, 2, 3, NaN]})
df_obj

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [16]:
df_obj.fillna('66.0')   # 使用66替换缺失值

      A     B  C     D
0     1  66.0  a  66.0
1     2     4  7     2
2     3  66.0  8     3
3  66.0     6  9  66.0

In [17]:
df_obj = pd.DataFrame({'A': [1, 2, 3, NaN],
                       'B': [NaN, 4, NaN, 6],
                       'C': ['a', 7, 8, 9],
                       'D': [NaN, 2, 3, NaN]})
df_obj

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [18]:
df_obj.fillna({'A': 4.0, 'B': 5.0})  # 指定列填充数据

     A    B  C    D
0  1.0  5.0  a  NaN
1  2.0  4.0  7  2.0
2  3.0  5.0  8  3.0
3  4.0  6.0  9  NaN

In [19]:
df = pd.DataFrame({'A': [1, 2, 3, None],
                   'B': [NaN, 4, None, 6],
                   'C': ['a', 7, 8, 9],
                   'D': [None, 2, 3, NaN]})
df

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  NaN  8  3.0
3  NaN  6.0  9  NaN

In [20]:
df.fillna(method='ffill')   # 使用前向填充的方式替换空值或缺失值

     A    B  C    D
0  1.0  NaN  a  NaN
1  2.0  4.0  7  2.0
2  3.0  4.0  8  3.0
3  3.0  6.0  9  3.0

In [21]:
person_info = pd.DataFrame({'id': [1, 2, 3, 4, 4, 5],
                            'name': ['小铭', '小月月', '彭岩', '刘华', '刘华', '周华'],
                            'age': [18, 18, 29, 58, 58, 36],
                            'height': [180, 180, 185, 175, 175, 178],
                            'gender': ['女', '女', '男', '男', '男', '男']})
person_info.duplicated()         # 从前向后查找和判断是否有重复值

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [22]:
person_info.drop_duplicates()   #显示删除重复的数据行，不破坏原有的表数据

   age gender  height  id name
0   18      女     180   1   小铭
1   18      女     180   2  小月月
2   29      男     185   3   彭岩
3   58      男     175   4   刘华
5   36      男     178   5   周华

In [23]:
person_info  #查看表数据

   age gender  height  id name
0   18      女     180   1   小铭
1   18      女     180   2  小月月
2   29      男     185   3   彭岩
3   58      男     175   4   刘华
4   58      男     175   4   刘华
5   36      男     178   5   周华

In [24]:
person_info.drop_duplicates(inplace=True)   #删除重复的数据行，破坏原有的表数据

In [25]:
person_info  #查看表数据

   age gender  height  id name
0   18      女     180   1   小铭
1   18      女     180   2  小月月
2   29      男     185   3   彭岩
3   58      男     175   4   刘华
5   36      男     178   5   周华

In [26]:
# 导入需要使用的CSV数据
file = open('./第4章数据文件资源/example_data.csv')
data = pd.read_csv(file)
data

      A  B
0     1  2
1     2  3
2     3  8
3     4  5
4     5  6
5   560  7
6     2  8
7     3  9
8     3  0
9     4  3
10    5  4
11    3  5
12    2  6
13    4  7
14    5  2
15   23  4
16    2  5
17  342  6
18    3  4

In [27]:
#定义一个函数three_sigma，通过3西格马的方式判断是否是异常值，如果是异常值，则将异常值返回
# ser1 表示传入DataFrame的某一列
def three_sigma(ser): 
    # 求平均值
    mean_value = ser.mean()
    # 求标准差
    std_value = ser.std()
    # 位于(μ-3σ,μ+3σ)区间的数据是正常的，不在这个区间的数据为异常的
    # ser中的数值小于μ-3σ或大于μ+3σ均为异常值
    # 一旦发现有异常值，就标注为True，否则标注为False
    #判断条件
    rule = (mean_value - 3 * std_value > ser) | (ser.mean() + 3 * ser.std() < ser)
    # 需要根据条件完成数据的索引，返回异常值的位置索引
    index = np.arange(ser.shape[0])[rule]   #获取行索引
    # 获取异常数据
    outrange = ser.iloc[index]
    return outrange

In [28]:
three_sigma(data['A'])

5    560
Name: A, dtype: int64

In [29]:
three_sigma(data.A)   #或者写成这种方式

5    560
Name: A, dtype: int64

In [30]:
three_sigma(data['B'])

Series([], Name: B, dtype: int64)

In [31]:
df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [2, 3, 5, 2],
                   'C': [1, 4, 7, 4],
                   'D': [1, 5, 30, 3]})
df

   A  B  C   D
0  1  2  1   1
1  2  3  4   5
2  3  5  7  30
3  4  2  4   3

In [32]:
df.boxplot(column=['A', 'B', 'C', 'D'])  #得到箱型图